["title": "Apple Agrees to Pay $53M to Settle iPhone Warranty Lawsuit", "desc": " Apple is agreeing to pay $53 million to settle a class action accusing the company of failing to honor warranties on iPhones and iPod Touches, according to an agreement obtained today by Wired. The settlement, (.pdf) &hellip;", "link": "http://www.wired.com/gadgetlab/2013/04/iphone-warranty-flap/", "cat": "news"]
["title": "Apple and Universal Music agreement on streaming iRadio service imminent", "desc": " Apple is expected to sign the largest record label perhaps as soon as next week, sources say.&nbsp; Warner Music is right behind. Apple is expected to sign its first internet radio licensing agreement &hellip;", "link": "http://www.theverge.com/2013/4/11/4214728/agreement-between-apple-and-universal-music-on-iradio-is-imminent", "cat": "news"]
["title": "Letter To Jennifer Allen Regarding False And Defamatory Statements", "desc": " The following letter from my attorneys was delivered to Jennifer Allen this afternoon, in response to her previous claims.&nbsp; I believe the letter speaks for itself. Eric M. George Browne George Ross Via E-Mail and U.S. Mail", "link": "http://uncrunched.com/2013/04/11/jennifer-allen-false-defamatory/", "cat": "news"]
["title": "Justice Department Looking To Change The Law That Made It Impossible To Serve Megaupload", "desc": " This one is a bit old, but it appears that nothing's happened on it yet. cosmicwonderful alerts us to the fact that, back in October, the DOJ asked the federal courts to amend the rules on serving criminal complaints to foreign companies.", "link": "http://www.techdirt.com/articles/20130214/11192721981/justice-department-looking-to-change-law-that-made-it-impossible-to-serve-megaupload.shtml", "cat": "news"]
["title": "Bump for iPhone loses the ability to share iTunes tracks between devices", "desc": " The popular peer-to-peer file sharing app Bump was updated to version 3.5.8 today, and according to the change notes one of the features has been removed.&nbsp; Apparently at Apple's request, the developers have disabled &hellip;", "link": "http://9to5mac.com/2013/04/11/bump-loses-the-ability-to-share-itunes-tracks-between-devices/", "cat": "news"]
["title": "We Are Hunted joins Twitter, shuttering its own service to help the social giant go music", "desc": " Music discovery service We Are Hunted has just confirmed that it has joined Twitter and will shutter its service. The announcement comes minutes after celebrity Ryan Seacrest appeared to confirm the existence of a Twitter music app.", "link": "http://thenextweb.com/twitter/2013/04/12/we-are-hunted-joins-twitter-shuttering-its-own-service-to-help-the-social-giant-go-music/", "cat": "news"]
["title": "eBay-Backed E-Commerce Software Company ChannelAdvisor Files For $86M IPO", "desc": " The latest technology company to join the IPO bandwagon is e-commerce optimization company ChannelAdvisor.&nbsp; The S-1, filed with the SEC today, indicates that ChannelAdvisor could raise as much as $86.25 million in an offering &hellip;", "link": "http://techcrunch.com/2013/04/11/ebay-backed-ecommerce-software-company-channeladvisor-files-for-86m-ipo/", "cat": "news"]
["title": "The Winklevoss Twins Say They Own 1% Of All Bitcoins", "desc": " It's all about Bitcoins lately, and the Winklevoss twins claim to own 1% of all Bitcoins in existence, Nathaniel Popper and Peter Lattman of the New York Times report. &ldquo;An array of speculators have now bid up the price of the Bitcoin &hellip;", "link": "http://www.businessinsider.com/the-winklevoss-twins-bitcoins-2013-4?op=1", "cat": "news"]
["title": "ICANN Says It Will Allow Chinese Top-Level Domain Names This Year, Followed By Other Languages", "desc": " The president of ICANN (the Internet Corporation for Assigned Names and Numbers) Fady Chehade told the Wall Street Journal that the organization will launch Chinese character options for top-level domains in the second half of this year.", "link": "http://techcrunch.com/2013/04/10/icann-says-it-will-allow-chinese-top-level-domain-names-this-year-followed-by-other-languages/", "cat": "news"]
["title": "Samsung Galaxy Mega Hands-On Review", "desc": " Samsung has just announced the Samsung Galaxy Mega, a device that has been talked about as a rumor until now.&nbsp; As its name indicates, and featuring a 6.3&Prime; display (there is also a 5.8&Prime; version), the Galaxy Mega is even bigger &hellip;", "link": "http://www.ubergizmo.com/2013/04/samsung-galaxy-mega-hands-on-review/", "cat": "news"]
["title": "Meet the Bitcoin Millionaires", "desc": " Many people have lost some data while reformatting a computer hard drive.&nbsp; Jered Kenna lost more than that.&nbsp; In 2010 he erased from his computer 800 Bitcoins that have been worth more than $200,000.&nbsp; Kenna isn't upset: He has plenty more.", "link": "http://www.businessweek.com/articles/2013-04-10/meet-the-bitcoin-millionaires", "cat": "news"]
["title": "Trends in 160+ locations", "desc": " Today, we're introducing Trends in more than 160 new locations.&nbsp; Included in that list are a number of countries that will be getting Trends for the first time: Belgium, Greece, Kenya, Norway, Poland, Portugal, and Ukraine, plus more than 130 new cities in countries that already have Trends.", "link": "http://blog.twitter.com/2013/04/trends-in-160-locations.html", "cat": "news"]
["title": "If Netflix Were on TV, It Might Be the Biggest Network on Cable.&nbsp; But About That New Show ...", "desc": "&nbsp; Good news for Netflix!&nbsp; The company streamed more than 4 billion hours of video in the first three months of the year, according to a Facebook post from CEO Reed Hastings.", "link": "http://allthingsd.com/20130411/if-netflix-was-on-tv-it-might-be-the-biggest-network-on-cable-but-about-that-new-show/", "cat": "news"]
["title": "Google sued for burying &lsquo;Streetmap&rsquo; search results", "desc": " A British mapping company named Streetmap is suing Google in U.K. court for what it called &ldquo;cynical manipulation of search results,&rdquo; that made its site harder to find in Google searches.&nbsp; A Google spokesman told Bloomberg he hadn't seen &hellip;", "link": "http://www.theverge.com/2013/4/11/4213276/google-sued-for-burying-streetmap-search-results", "cat": "news"]
["title": "BlackBerry 10 launch by the numbers: Over 50% returns", "desc": ", 71% of people don't want under any circumstances, 83% of Americans unaware it even launched (Updated) Six years after Apple took the smartphone industry by surprise with its release of the iPhone, former market leader BlackBerry Limited &hellip;", "link": "http://9to5mac.com/2013/04/11/blackberry-10-launch-by-the-numbers-over-50-returns-71-of-people-dont-want-under-any-circumstances-83-of-americans-unaware-it-even-launched/", "cat": "news"]
