{"title": "The Pirate Bay Becomes #1 File-Sharing Site as Cyberlockers Collapse", "desc": " Less than two years ago we published an overview of the most used file-sharing sites, covering both BitTorrent and traditional cyberlockers. At the time one-click download sites were beating BitTorrent sites by a landslide.", "link": "http://torrentfreak.com/the-pirate-bay-becomes-1-file-sharing-site-cyberlockers-collapse-130330/", "cat": "news"}
{"title": "World's top supercomputer from '09 is now obsolete, will be dismantled", "desc": " Roadrunner, formerly the world's fastest supercomputer, is being decommissioned today. Los Alamos National Laboratory Five years ago, an IBM-built supercomputer designed to model the decay &hellip;", "link": "http://arstechnica.com/information-technology/2013/03/worlds-fastest-supercomputer-from-09-is-now-obsolete-will-be-dismantled/", "cat": "news"}
{"title": "New book shares insights from Steve Jobs' 1st boss", "desc": " SAN FRANCISCO (AP) &mdash; When Steve Jobs adopted &ldquo;think different&rdquo; as Apple's mantra in the late 1990s, the company's ads featured Albert Einstein, Bob Dylan, Amelia Earhart and a constellation of other starry-eyed oddballs who reshaped society.", "link": "http://www.google.com/hostednews/ap/article/ALeqM5gZY1cysT3dLA3MgGwO7V33m1hmxw", "cat": "news"}
{"title": "Round Up: All of Google's jokes for April Fools 2013", "desc": " Every year, Google goes all out for April Fools' Day.&nbsp; The company not only pulls together more jokes than all the other tech giants, but the company makes a point to outdo itself too.&nbsp; It honestly gets difficult to keep track &hellip;", "link": "http://thenextweb.com/google/2013/03/31/round-up-all-of-googles-jokes-for-april-fools-2013-from-google-maps-treasure-hunting-to-youtube-closing/", "cat": "news"}
{"title": "Angry Twitterers Are Threatening To Switch To Bing After Google Honors Labor Leader Cesar Chavez On Easter", "desc": " Google's decision to celebrate Cesar Chavez's birthday today in its Doodle, rather than Easter, has spurred some mixed reviews on Twitter. Cesar Chavez, whose 86th birthday would be today &hellip;", "link": "http://www.businessinsider.com/google-honors-cesar-chavez-on-easter-2013-3?op=1", "cat": "news"}
{"title": "TV Service Providers Held Talks With Aereo", "desc": " Aereo Inc., the Web television startup backed by media mogul Barry Diller, has discussed partnerships with major pay-TV distributors and Internet service providers, including AT&amp;T Inc. and Dish Network Corp., as it looks to roll out its fledgling service &hellip;", "link": "http://online.wsj.com/article_email/SB10001424127887323501004578391023454905916-lMyQjAxMTAzMDMwMTEzNDEyWj.html", "cat": "news"}
{"title": "The Building is the New Server", "desc": " The personal computer is dead.&nbsp; As quickly as we moved from the desktop to the laptop, we are moving to the tablet &mdash; never to return.&nbsp; With the death of the PC, an entire ecosystem dies with it.&nbsp; The chipset is ARM based, rather than Intel.", "link": "http://scott.a16z.com/2013/03/28/the-building-is-the-new-server/", "cat": "news"}
{"title": "Michael Dell Said to Consider Blackstone LBO With CEO Guarantee", "desc": " Dell Inc. founder Michael Dell will only consider backing a buyout by Blackstone Group LP if the private-equity firm guarantees he can remain as chief executive officer, according to a person familiar with the discussions.", "link": "http://www.bloomberg.com/news/2013-03-31/michael-dell-said-to-consider-blackstone-lbo-with-ceo-guarantee.html", "cat": "news"}
{"title": "Facebook Is Taking On Reddit's &ldquo;Ask Me Anything&rdquo; Series", "desc": " The social network's newest feature could create a rival to Reddit's AMA giant Watch out, Reddit. This week, Facebook rolled out a new threaded comment feature, allowing users respond to specific comment in a conversation thread &hellip;", "link": "http://www.buzzfeed.com/charliewarzel/facebook-is-taking-on-reddits-ask-me-anything-series", "cat": "news"}
{"title": "7 hidden gems in Windows Blue", "desc": " Some yet-to-be unveiled facts and hints about what's coming to the Windows ecosystem in late 2013. Windows Blue, leaked last Sunday.&nbsp; And a few days later, Microsoft publicly acknowledged its existence (coincidentally or not) in the announcement for its BUILD conference.", "link": "http://www.itworld.com/windows/350114/7-hidden-gems-windows-blue", "cat": "news"}
{"title": "AngelList Receives SEC No-Action Letter Two Days After FundersClub", "desc": " Updated at 1:53pm PST with comments from AngelList CEO Naval Ravikant. On March 26th The Funders Club received a no-action letter from the Securities and Exchange Commission stating that it will not recommend enforcement action &hellip;", "link": "http://www.daniellemorrill.com/2013/03/angellist-receives-sec-no-action-letter-days-after-fundersclub/", "cat": "news"}
{"title": "Lowest Cost Raspberry Pi Microcomputer Now On Sale In The U.S. - $25 Model A Suited For Battery/Solar Powered Projects", "desc": " The Raspberry Pi microcomputer prides itself on being affordable, with its tiny $35 price-tag for the original Model B Pi.&nbsp; But now its lowest cost board &mdash; the $25 Model A &hellip;", "link": "http://techcrunch.com/2013/03/31/raspberry-pi-model-a-arrives-in-us/", "cat": "news"}
{"title": "Letting Down Our Guard With Web Privacy", "desc": " SAY you've come across a discount online retailer promising a steal on hand-stitched espadrilles for spring.&nbsp; You start setting up an account by offering your e-mail address &mdash; but before you can finish, there's a ping on your phone.&nbsp; A text message.", "link": "http://www.nytimes.com/2013/03/31/technology/web-privacy-and-how-consumers-let-down-their-guard.html?pagewanted=all", "cat": "news"}
{"title": "The deal Goodreads should've struck (hint: it wasn't with Amazon)", "desc": " Goodreads, the popular social network and review site for book lovers, is now part of Amazon.&nbsp; Imagine if it had instead paired up with Readmill, which offers a superior user reading experience.", "link": "http://paidcontent.org/2013/03/30/the-deal-goodreads-shouldve-struck-hint-it-wasnt-with-amazon/", "cat": "news"}
{"title": "Boston police catfishing indie rockers: Cops pose as punks on the Internet.", "desc": " The Boston police go undercover on the Internet to stop the city's most dreaded scourge: DIY indie-rock shows. As anyone who's watched a single crime story on TV or film knows, undercover detective work is dangerous business.", "link": "http://www.slate.com/articles/news_and_politics/crime/2013/03/boston_police_catfishing_indie_rockers_cops_pose_as_punks_on_the_internet.single.html", "cat": "news"}
